def balltle():
    '''
    1. 해파리 : 두마리가 나오고 체력 50 나는 체력 150
    1-1. 공격력 : 나는 일반공격 25 해파리는 15
    1-2. 방어 : 방어 시 방어력이 10 상승
    2. 심해 물고기 : 세마리인데 한마리는 체력이 25 더 높고 공격력이 15 더 높음
    나는 체력 250 물고기 체력 100
    2-1. 공격력 : 나는 40 물고기 30
    2-2. 새로운 스킬 : 야바위 어택 - 0 부터 70 까지 공격력 랜덤 두 턴마다 사용 가능
    2-3. 방어 : 방어 시 방어력이 25 상승
    3. 보스전(크라켄) : 체력 400 나는 체력 300
    3-1. 공격력 : 나는 50 크라켄 70
    3-2. 방어 : 방어시 방어력이 50 상승 크라켄이 필살기를 쓸 시 방어하면 100 상승
    3-3. 크라켄 필살기 : 60 이하의 체력일 떄 크라켄이 필살기를 사용 
    크라켄 필살기 사용 시 150의 데미지를 입음 방어 시 45
    '''

def lv_up():
    '''
    1. 첫 레벨업
    1-1.크리스탈 소드 : 공격력과 방어력이 15 상승 야바위 어택을 사용 가능
    1-2. 체력 증가 : 체력이 100 상승 체력 전체 회복
    2. 두번째 레벨업
    2-1.야바위 어택 강화 : 0 ~ 100
    2-2.스탯 강화 : 체력 전체 회복 및 50 상승 공력력 10 상승 방어력 25 상승
    2-3.아이템 산소통 사용 가능 산소통: 체력 80 회복 아이템 사용 후 자동으로 일반공격이 나감
    '''

def random_crystal():
    '''
    1. 야바위 게임
    1-1. 규칙 : 돌맹이 5개 중 진짜 크리스탈이 들어있는 돌을 골라야 함 기회 3번
    1-2. 보상 : 연료 크리스탈 
    1-3. 실패 : 데미지를 15 입고 다시 시작

    '''

def read_it():
    '''
    1. 주문외우기
    1-1 방법 : 제시된 거꾸로 된 단어를 올바르게 입력
    1-2 보상 : 연료 크리스탈, 비상용 산소통
    
    '''

def password():
    '''
    1. 비밀번호 입력
    1-1. 방법 : 야구 게임 방식으로 비밀번호 찍기
    1-2. 보상 : 연료 크리스탈, 폭탄
    
    '''

def story():
    '''
    1. 처음

    '''